impl/soap-header/src/test/resources/soap/filter/1k.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:log="http://xmlns.greenbird.com/schema/logger"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1"><wsse:UsernameToken wsu:Id="UsernameToken-1"><wsse:Username>greenbird</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">[*****]</wsse:Password></wsse:UsernameToken></wsse:Security></soapenv:Header><soapenv:Body><log:performLogMessageRequest><samlp:Response xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol">value</samlp:Response></log:performLogMessageRequest></soapenv:Body></soapenv:Envelope>